{
    "version": "v1.0.0",
    "entity": {
        "type": "individual",
        "role": "maintainer",
        "name": "Pushparaj Mehta",
        "email": "pushparajmehta002@gmail.com",
        "phone": "",
        "description": "I am a developer focused on simplifying payment gateway integrations. UniPay aims to alleviate the hassle and pain of integrating multiple payment gateways by providing a unified solution. My goal is to help developers streamline their projects and enhance their payment processes through open-source technologies.",
        "webpageUrl": {
            "url": "https://github.com/Pushparaj13811/unipay",
            "wellKnown": ""
        }
    },
    "projects": [
        {
            "guid": "unipay",
            "name": "UniPay",
            "description": "UniPay is an open-source SDK designed to unify the integration of multiple payment gateways into a single, streamlined solution. By using UniPay, developers can register their preferred payment gateways and manage payments without the complexity of handling multiple SDKs.",
            "webpageUrl": {
                "url": "https://github.com/Pushparaj13811/unipay"
            },
            "repositoryUrl": {
                "url": "https://github.com/Pushparaj13811/unipay",
                "wellKnown": "https://github.com/Pushparaj13811/unipay/blob/main/.well-known/funding-manifest-urls"
            },
            "licenses": [
                "UniPay License"
            ],
            "tags": [
                "payment-gateway",
                "open-source",
                "sdk",
                "developer-tools"
            ]
        }
    ],
    "funding": {
        "channels": [
            {
                "guid": "paypal",
                "type": "payment-provider",
                "address": "https://paypal.me/yourusername",
                "description": "Support UniPay through PayPal. Your contributions will help maintain and develop the project further."
            },
            {
                "guid": "patreon",
                "type": "subscription",
                "address": "https://www.patreon.com/yourusername",
                "description": "Become a patron to support UniPay development with monthly contributions and gain access to exclusive content."
            }
        ],
        "plans": [
            {
                "guid": "development-funding",
                "status": "active",
                "name": "Development Funding",
                "description": "This plan helps cover costs for ongoing development efforts and enhancements to the UniPay SDK.",
                "amount": 500,
                "currency": "USD",
                "frequency": "monthly",
                "channels": [
                    "patreon"
                ]
            },
            {
                "guid": "goodwill-support",
                "status": "active",
                "name": "Goodwill Contributions",
                "description": "A one-time contribution to show your support for the project.",
                "amount": 0,
                "currency": "USD",
                "frequency": "one-time",
                "channels": [
                    "paypal",
                    "patreon"
                ]
            }
        ],
        "history": [
            {
                "year": 2024,
                "income": 0,
                "expenses": 0,
                "taxes": 0,
                "currency": "USD",
                "description": "Project initiated. Currently in development phase."
            }
        ]
    },
    "license": {
        "text": "The UniPay License\nCopyright (c) 2024 Hompushparaj Mehta\n\nPermission is hereby granted, free of charge, to any person or entity obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, and distribute the Software, subject to the following conditions:\n\nAttribution\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. All users must provide appropriate credit to the original author (Hompushparaj Mehta), a link to the license, and indicate if changes were made.\n\nDeveloper Integration\nDevelopers and companies can easily install UniPay in their projects and use it without needing to modify any part of the original Software. The Software is designed for direct integration into applications as is, ensuring a seamless experience for end-users. Any attempt to alter the Software for the purpose of claiming it as a proprietary product is strictly prohibited.\n\nEncouragement of Contributions\nWe welcome contributions from the community! Developers are encouraged to submit changes, improvements, and bug fixes to the Software. All contributions should be made through a pull request or other specified method. Contributors can improve the Software while respecting its core structure and functionality.\n\nRestrictions on Modification and Commercialization\nCompanies and individuals are explicitly prohibited from making minor changes to the Software with the intention of claiming it as their proprietary product. Specifically:\n\nThe unmodified Software may not be sold, licensed, or otherwise commercialized as a standalone product without prior written permission from the copyright holder, Hompushparaj Mehta.\nAny integration of the Software must retain its original form without modification to comply with this license.\nMinor changes to the Software should not lead to claims of ownership or proprietary rights over the original Software.\nSignificant Modifications\nProducts, services, or applications that incorporate the Software may be sold or commercialized without restriction, provided that:\n\nNo minor changes are made to the original Software.\nSignificant modifications that alter the functionality or purpose of the Software may be considered for commercialization, but must be clearly distinct from the original Software.\nDerivative Works\nAny distribution of the Software or derivative works must be under the same terms as this license. Users creating derivative works must ensure that their modifications are substantial enough to differentiate them from the original Software.\n\nCommunity Engagement\nWe believe in the power of community collaboration. Contributions from developers will be acknowledged in the project’s documentation and changelog. We encourage open discussions on issues, feature requests, and enhancements through our official communication channels.\n\nDisclaimer of Warranty\nThe Software is provided \"as is\", without warranty of any kind, express or implied, including but not limited to the warranties of merchantability, fitness for a particular purpose, and noninfringement. In no event shall the authors or copyright holders be liable for any claim, damages, or other liability, whether in an action of contract, tort, or otherwise, arising from, out of, or in connection with the Software or the use or other dealings in the Software.\n\nContact Information\nFor inquiries regarding the sale or commercialization of the Software itself, or any questions regarding this license, please contact Hompushparaj Mehta at pushparajmehta002@gmail.com.\n\nKey Definitions\nSoftware: Refers to the original code, documentation, and related files associated with the UniPay project.\nUnmodified Portions: Sections of the Software that remain unchanged from their original state as distributed by the copyright holder.\nModification: Any alteration to the Software that changes its functionality or adds new features.\nDerivative Works: Works that are based on or derived from the Software, including modifications and adaptations.\nSignificant Modifications: Changes that meaningfully alter the functionality or purpose of the Software, such as adding new features or integrating with other systems."
    }
}
